Revit 2026 API

# ElectricalPhaseConfiguration Enumeration

---

An enumerated type to specify the electrical phase configuration.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ElectricalPhaseConfiguration
```
```vb
Public Enumeration ElectricalPhaseConfiguration
```
```cpp
public enum class ElectricalPhaseConfiguration
```
```fsharp
type ElectricalPhaseConfiguration
```

| Member name | Value | Description |
| --- | --- | --- |
| Delta | 2 | Electrical phase configuration is delta. |
| Undefined | 0 | Electrical phase configuration is undefined. |
| Wye | 1 | Electrical phase configuration is Y. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace